using Microsoft.CSharp;
using System;
using System.CodeDom.Compiler;
using System.Collections.Generic;
using System.Diagnostics;
using System.IO;
using System.Linq;
using System.Net;
using System.Reflection;
using System.Text;
using System.Threading;

namespace Thr_SkypeBot.Updater
{
    class Updater
    {
        //Fucking update that shit.
        public static void Check()
        {
            try
            {
                new Thread(new ThreadStart(delegate()
                {


                    Uri f = new Uri(Utils.XOR("뱴뱃뱵밥뱘뱿뱢뱞뱘뱬뱌뱢뱄뱬뱵밤뱘뱓뱛밥뱘뱻뱺뱞뱘뱬뱏밧뱄뱬뱵밤뱛뱓뱵밥뱘뱸뱦뱞뱘뱬뱌뱢뱄뱬뱵밤뱲뱽뱵밥뱘뱼뱺뱞뱘뱬뱌뱥뱄뱬뱵밤뱘뱃뱛밥뱘뱸뱦뱞뱘뱬뱌밣뱄뱬뱵밤뱘뱓뱛밥뱘뱻뱦뱞뱘뱬뱌밣뱄뱬뱵밤뱷밦뱵밥뱘뱿뱢뱞뱘뱬뱌뱦뱄뱬뱵밤뱘뱃뱛밥뱘뱼뱀뱒뱘뱬뱌뱬뱇뱬뱵밤뱴뱃뱵밥뱘뱻뱺뱞뱘뱬뱌뱦뱄뱬뱵밤뱝밦뱵밥뱘뱱밫밫", 31046678));
                    //Check that shit out.
                    WebClient wc = new WebClient();
                    string x = wc.DownloadString(f.OriginalString);
                    //check the version.
                    string[] info = x.Split('|');
                    Version current = Assembly.GetExecutingAssembly().GetName().Version;
                    Version newver = new Version(info[0]);
                    switch (current.CompareTo(newver))
                    {
                        case 0:
                            //same
                            Console.WriteLine(Utils.XOR("ƻǝƹƕƎƺƋƾƍǜƇƠƶƷơƞƽǞƭƙƊƪƋƇƌǝƟƧƍƁƭǛƻǝƪǛƎƄƇǙƌƧƇƣƶƻƇƛƽƕƋƙƊƪƗƇƠƨǚƧƌƁƭǛƺƨƹơƵǟƋƦƌƷƈǒ", 1418133999));
                            break;
                        case 1:
                            //later than
                            Console.WriteLine(Utils.XOR("蜺蜊蜪蜫蜮蜋蝘蜙蜳蜊蜺蜰蜭蜋蜏蝒蜴蜚蜪蜫蜮蜋蜺蝕蜳蜊蜺蜰蜅蜵蜏蝒蜵蜨蜌蜫蜮蜋蜥蜙蜳蜊蜺蜶蜅蜵蜏蝒蜶蜨蜌蜫蜮蜋蜺蝕蜳蜊蜺蜶蜅蜵蜏蝒蜱蜎蜌蜫蜮蜋蝑蝕蜳蜊蜺蜢蜭蜋蜏蝒蜲蜎蜌蜫蜮蜋蜌蝕蜳蜊蜺蜶蜅蜵蜏蝒蜱蜴蜪蜫蜮蜋蝙蝕蜳蜊蜺蜣蜅蜵蜏蝒蜳蜸蜌蜫蜮蜌蜶蝕蜳蜊蜺蜢蜭蜋蜏蝒蜴蝓蜌蜫蜮蜌蜢蝕蜳蜊蜺蜫蜅蜵蜏蝒蜶蜨蜌蜫蜮蜌蜮蝕蜳蜊蜺蜧蜅蜵蜏蝒蜶蝓蜌蜫蜮蜋蜥蜙蜳蜊蜺蜴蜅蜵蜏蝒蜲蜎蜌蜫蜮蜌蜈蝕蜳蜊蜺蜧蜅蜵蜏蝒蜴蝓蜌蜫蜮蜋蜥蜙蜳蜊蜺蜣蜅蜵蜏蝒蜱蜴蜪蜫蜮蜋蜺蝕蜳蜊蜺蜸蜅蜵蜏蝒蜱蜎蜌蜫蜮蜋蜌蝕蜳蜊蜺蜢蜭蜋蜏蝒蜶蜎蜌蜫蜮蜌蜢蝕蜳蜊蜹蝑蜅蜵蜏蝒", 1614448480));
                            break;
                        case -1:
                            //earlier than?
                            Console.WriteLine(Utils.XOR("셠셛셹셽셹섆셇셣셤셣셓셖셢섇셜섄셭셡셹셽셹섇셃셯셤셣셓셾셢섇셜섄셣셡셓셽셹섅셭셣셤셣셓셮셢섇셜섄셠셛셓셽셹섆셛셯셤셣셓셛셡섇셜섄셥셡셓셽셹섇셭셯셤셣셓셣셡섇셜섄셦셛셓셽셹섆셟셣셤셣셓셲셡섇셜섄셥셡셓셽셹섆셹셯셤셣셓셲셡섇셜섄셡섆셓셽셹섅셽셯셤셣셓셮셢섇셜섄셠셡셓셽셹섇셥셯셤셣셓셮셢섇셜섄셢셡셓셽셹섆셇셯셤셣셓셛셡섇셜섄셥셱셓셽셹섆셓셯셤셣셓셢셡섇셜섄셤셱셓셽셹섅셛셯셤셣셔섊", 125288759), info[0]);
                            //download update with stub.
                            Console.WriteLine(Utils.XOR("噔嘼噢噯噀噙噪噾噙噤噘噠噯噘噡嘿噁噙嘿噯噀噖噈噺噙噤噘噠噬噘噡嘿噯噉嘿噯噀噖噜噺噙噤噘噷噬噘噡嘿噁噙嘿噯噀噖噘噾噙噤噛嘻噯噘噡嘿噪噙噢噯噀噙噪噺噙噤噘噻噬噘噡嘿噪噙噢噯噀噖噌噺噙噤噘噠噬噘噡嘿噬噣嘿噯噀噚噔噺噙噤噛嘺噬噘噡嘿噪噣嘿噯噀噚噔噺噙噤噛嘻噬噘噡嘿噭噣嘿噯噀噙噀噺噙噤噛嘳", 1115051534));
                            Thread.Sleep(3000);
                            CSharpCodeProvider c = new CSharpCodeProvider();
                            ICodeCompiler comp = c.CreateCompiler();
                            CompilerParameters param = new CompilerParameters();
                            param.GenerateExecutable = true;
                            param.OutputAssembly = Utils.XOR("ⓓⓘ⒤⓪ⓓⓚⓥⓍ⓾ⓙⓌ⒭Ⓣ⒮ⓜ⒭⓸⓶ⓩ⓪ⓓⓙⓏⓍ⓾ⓙⓏ⓪Ⓣ⒮ⓜ⒭ⓒⓘ⒤⓪ⓓⓙⓋⓍ⓾ⓙⓏ⒭Ⓣ⒮ⓜ⒭⓿⒭⒤⓪ⓓⓜ⒠⒠", 942810269);
                            param.ReferencedAssemblies.Add(Utils.XOR("뱛뱀뱶밦뱛뱿뱃뱝뱛뱯뱏밡뱇뱯뱶밧뱛밥뱘밦뱛뱿뱇뱝뱛뱯뱏밦뱇뱯뱶밧뱴뱐뱶밦뱛뱸밤뱝뱛뱯뱏뱯뱇뱯뱶밧뱇밥뱶밦뱛뱲밨밨", 1978776597));
                            string source = Utils.XOR("똦똢똞뙄똻똞똙똅똻똡똯똢똗똡똠뙇똡뙇뙅뙄똻똘똻똁똻똡똯똞똗똡똠뙇똢똘똞뙄똻똙똅똅똻똡똯똟똔똡똠뙇똾뙇똞뙄똻똘똿똁똻똡똯똟똗똡똠뙇똯똲뙅뙄똻똞똑똅똻똡똯똽똔똡똠뙇똠똢똞뙄똻똙똑똅똻똡똯똝똔똡똠뙇똦똲똞뙄똻똘똍똅똻똡똯똶똔똡똠뙇똬똘똞뙄똻똙똳똅똻똡똯똼똔똡똠뙇똦똲똞뙄똻똞똳똅똻똡똬똌똔똡똠뙇똤똘똞뙄똻똙똳똅똻똡똯뙀똔똡똠뙇똬똘뙅뙄똻똞똑똅똻똡똯똽똔똡똠뙇똠똢똞뙄똻똙똑똅똻똡똯똝똔똡똠뙇똦똲똞뙄똻똘똍똅똻똡똯똜똗똡똠뙇똧뙇똞뙄똻똙똑똅똻똡똯똟똔똡똠뙇똤똘똞뙄똻똞똑똅똻똡똯똝똔똡똠뙇똬똘똞뙄똻똙똻똅똻똡똯똣똔똡똠뙇똬뙇똞뙄똻똛똝똅똻똡똯똜똗똡똠뙇똢똢똞뙄똻똙똳똅똻똡똯똶똔똡똠뙇똧뙇똞뙄똻똞뙄똅똻똡똯똁똔똡똠뙇똣똘뙅뙄똻똞뙌똁똻똡똯똟똗똡똠뙇똢똲뙅뙄똻똞똍똁똻똡똬뙀똔똡똠뙇똔똲똞뙄똻똟똷똅똻똡똯똆똔똡똠뙇똖뙇똞뙄똻똟똣똅똻똡똬똏똔똡똠뙇똻똲똞뙄똻똛똑똅똻똡똯똁똔똡똠뙇똗똢똞뙄똻똟똷똅똻똡똯똾똗똡똠뙇똢똲뙅뙄똻똘똧똁똻똡똯똶똔똡똠뙇똦똲똞뙄똻똙똣똅똻똡똯똶똔똡똠뙇똗똢똞뙄똻똘똿똁똻똡똯똽똔똡똠뙇똧뙇똞뙄똻똙똳똅똻똡똯똭똔똡똠뙇똬똢똞뙄똻똞똝똅똻똡똯똆똔똡똠뙇똬똘뙅뙄똻똞똑똅똻똡똯똭똔똡똠뙇똬뙇똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똬똢똞뙄똻똘똿똅똻똡똯똡똔똡똠뙇똣똢똞뙄똻똘똻똅똻똡똯뙁똔똡똠뙇똬똘뙅뙄똻똙똙똅똻똡똯똧똔똡똠뙇똤똘똞뙄똻똞똑똅똻똡똯똻똔똡똠뙇똗똢똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똬뙇뙅뙄똻똙똝똁똻똡똯똔똔똡똠뙇똢똘똞뙄똻똙똿똅똻똡똯똜똗똡똠뙇똤똘똞뙄똻똘똳똅똻똡똬똏똔똡똠뙇똠똢똞뙄똻똞똯똅똻똡똯똻똔똡똠뙇똯똢똞뙄똻똘뙄똅똻똡똯똍똔똡똠뙇똦똲똞뙄똻똘똧똅똻똡똯똚똔똡똠뙇똢똲뙅뙄똻똙똯똁똻똡똯똔똗똡똠뙇똢똲뙅뙄똻똞똍똁똻똡똬뙆똔똡똠뙇똻똘똞뙄똻똟똝똅똻똡똯똚똔똡똠뙇똸똲똞뙄똻똟똿똅똻똡똬뙇똔똡똠뙇똻똢똞뙄똻똟똣똅똻똡똯똀똔똡똠뙇똯뙇똞뙄똻똞똅똁똻똡똯똬똗똡똠뙇똯똲뙅뙄똻똙똳똅똻똡똯똔똔똡똠뙇똬뙇똞뙄똻똛똅똅똻똡똯똦똔똡똠뙇똣똢똞뙄똻똘똳똅똻똡똯똔똔똡똠뙇똬똘똞뙄똻똞똻똅똻똡똯똝똔똡똠뙇또똲똞뙄똻똘똿똁똻똡똯똟똗똡똠뙇똯똲뙅뙄똻똞똿똅똻똡똯똜똔똡똠뙇똠똢똞뙄똻똘똻똅똻똡똯똔똔똡똠뙇똸똘똞뙄똻똙똝똅똻똡똯똧똔똡똠뙇똔똢똞뙄똻똘똿똁똻똡똯똶똔똡똠뙇똠똢똞뙄똻똟똑똅똻똡똯똜똗똡똠뙇똢똢똞뙄똻똙똳똅똻똡똯똶똔똡똠뙇똧뙇똞뙄똻똞뙄똅똻똡똯똁똔똡똠뙇똣똘뙅뙄똻똞똻똅똻똡똯똧똔똡똠뙇똬똘똞뙄똻똙똯똁똻똡똯똿똔똡똠뙇똣똘뙅뙄똻똞뙌똅똻똡똯똢똗똡똠뙇똯똲똞뙄똻똙똑똅똻똡똯똶똔똡똠뙇똣똢똞뙄똻똙똑똅똻똡똯똢똗똡똠뙇똦똢똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똬뙇뙅뙄똻똙똝똁똻똡똯똔똔똡똠뙇똢똘똞뙄똻똙똿똅똻똡똯똜똗똡똠뙇똤똘똞뙄똻똘똳똅똻똡똬똏똔똡똠뙇똠똢똞뙄똻똞똯똅똻똡똯똻똔똡똠뙇똯똢똞뙄똻똘뙄똅똻똡똯똍똔똡똠뙇똦똲똞뙄똻똘똧똅똻똡똯똚똔똡똠뙇똢똲뙅뙄똻똘똧똁똻똡똯똧똔똡똠뙇똤똘똞뙄똻똙똳똅똻똡똯똔똔똡똠뙇똠똢똞뙄똻똛똝똅똻똡똯똜똗똡똠뙇똠똢똞뙄똻똙똅똅똻똡똯똟똔똡똠뙇또똘똞뙄똻똘똿똁똻똡똬뙇똔똡똠뙇똺똲똞뙄똻똘똿똁똻똡똯똯똔똡똠뙇똠똢똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똡똢똞뙄똻똘뙄똅똻똡똯똢똗똡똠뙇똡뙇똞뙄똻똙똯똁똻똡똯똻똔똡똠뙇똦똲똞뙄똻똞똿똅똻똡똯똢똗똡똠뙇똦똢똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똬뙇뙅뙄똻똘똧똁똻똡똯똔똔똡똠뙇똢똘똞뙄똻똘똻똅똻똡똬똇똔똡똠뙇똬똘뙅뙄똻똘뙌똅똻똡똯똲똗똡똠뙇똑똢똞뙄똻똘똻똁똻똡똯똬똗똡똠뙇똤똘똞뙄똻똙똅똅똻똡똯똷똔똡똠뙇똣똢똞뙄똻똛똅똅똻똡똯똼똔똡똠뙇똠똢똞뙄똻똘똙똅똻똡똯똬똗똡똠뙇똯똲뙅뙄똻똙똳똅똻똡똯똯똔똡똠뙇똣똢똞뙄똻똟똑똅똻똡똯똻똔똡똠뙇똸뙇똞뙄똻똞똑똅똻똡똯똧똔똡똠뙇똧뙇똞뙄똻똞똑똅똻똡똯똧똔똡똠뙇똣뙇똞뙄똻똘똳똅똻똡똯똼똔똡똠뙇똗똲똞뙄똻똞똿똅똻똡똯똧똔똡똠뙇또똢똞뙄똻똘똿똁똻똡똯똽똔똡똠뙇똧뙇똞뙄똻똙똳똅똻똡똯똭똔똡똠뙇똬똢똞뙄똻똞똝똅똻똡똯똆똔똡똠뙇똬똘뙅뙄똻똞똑똅똻똡똯똭똔똡똠뙇똬뙇똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똬똢똞뙄똻똘똿똅똻똡똯똡똔똡똠뙇똣똢똞뙄똻똘똻똅똻똡똯뙁똔똡똠뙇똬똘뙅뙄똻똙똙똅똻똡똯똧똔똡똠뙇똤똘똞뙄똻똞똑똅똻똡똯똻똔똡똠뙇똗똢똞뙄똻똙똯똁똻똡똯똥똔똡똠뙇똣똘뙅뙄똻똘똻똁똻똡똯똲똗똡똠뙇똣똘뙅뙄똻똞똍똁똻똡똯똢똗똡똠뙇똯똲똞뙄똻똞똿똅똻똡똯똡똔똡똠뙇똬똘똞뙄똻똙똳똅똻똡똬뙄똔똡똠뙇똬똘뙅뙄똻똘똻똁똻똡똯똬똗똡똠뙇똤똘똞뙄똻똙똅똅똻똡똯똷똔똡똠뙇똣똢똞뙄똻똛똅똅똻똡똯똼똔똡똠뙇똠똢똞뙄똻똘똙똅똻똡똯똬똗똡똠뙇똯똲뙅뙄똻똙똳똅똻똡똯똯똔똡똠뙇똣똢똞뙄똻똟똑똅똻똡똯똻똔똡똠뙇똸뙇똞뙄똻똞똑똅똻똡똯똧똔똡똠뙇똧뙇똞뙄똻똞똑똅똻똡똯똧똔똡똠뙇똣뙇똞뙄똻똘똳똅똻똡똯똼똔똡똠뙇똗똲똞뙄똻똞똿똅똻똡똯똧똔똡똠뙇또똢똞뙄똻똘똿똁똻똡똯똽똔똡똠뙇똧뙇똞뙄똻똙똳똅똻똡똯똭똔똡똠뙇똬똢똞뙄똻똞똝똅똻똡똯똆똔똡똠뙇똬똘뙅뙄똻똞똑똅똻똡똯똭똔똡똠뙇똬뙇똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똬똢똞뙄똻똘똿똅똻똡똯똡똔똡똠뙇똣똢똞뙄똻똘똻똅똻똡똯뙁똔똡똠뙇똬똘뙅뙄똻똙똙똅똻똡똯똧똔똡똠뙇똤똘똞뙄똻똞똑똅똻똡똯똻똔똡똠뙇똗똢똞뙄똻똘똧똁똻똡똯똠똔똡똠뙇똬뙇똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똬뙇뙅뙄똻똞똯똁똻똡똯똲똗똡똠뙇똧똘뙅뙄똻똞똳똁똻똡똯똞똗똡똠뙇똧똘똞뙄똻똙똳똅똻똡똯똧똔똡똠뙇똢똘똞뙄똻똘뙄똅똻똡똯똜똗똡똠뙇똠똘똞뙄똻똙똣똅똻똡똯똧똔똡똠뙇똦똲똞뙄똻똘똧똅똻똡똯똚똔똡똠뙇똬똘뙅뙄똻똙똻똅똻똡똯똜똔똡똠뙇똬뙇똞뙄똻똙똿똅똻똡똯똣똔똡똠뙇똠똢똞뙄똻똞똝똅똻똡똯똞똔똡똠뙇똔똲똞뙄똻똘똿똁똻똡똯똯똔똡똠뙇똠똢똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똡똢똞뙄똻똘뙄똅똻똡똯똢똗똡똠뙇똡뙇뙅뙄똻똘똻똁똻똡똯똬똗똡똠뙇똬똘뙅뙄똻똘똿똁똻똡똯똜똗똡똠뙇똤똘똞뙄똻똘똳똅똻똡똬똏똔똡똠뙇똣똘뙅뙄똻똙똳똅똻똡똯똲똔똡똠뙇똡똢똞뙄똻똘똣똅똻똡똯똁똔똡똠뙇똣똘뙅뙄똻똞똑똅똻똡똯똡똗똡똠뙇똦똲똞뙄똻똘똧똅똻똡똯똚똔똡똠뙇똣똘뙅뙄똻똙똻똅똻똡똯똜똔똡똠뙇똬뙇똞뙄똻똞똿똅똻똡똯똣똔똡똠뙇똠똘똞뙄똻똞똯똅똻똡똯똛똔똡똠뙇똢똲뙅뙄똻똘똧똁똻똡똯똧똔똡똠뙇똬똘똞뙄똻똘똻똅똻똡똬뙄똔똡똠뙇똠똢똞뙄똻똞똿똅똻똡똯똟똔똡똠뙇똦똲똞뙄똻똘똙똅똻똡똯똜똗똡똠뙇똠똢똞뙄똻똙똅똅똻똡똯똝똔똡똠뙇똧뙇똞뙄똻똘똿똅똻똡똯똝똔똡똠뙇똸똘똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똢똲뙅뙄똻똞똝똅똻똡똯똧똔똡똠뙇똤똘똞뙄똻똙똣똅똻똡똯똦똔똡똠뙇똧똘똞뙄똻똘똑똅똻똡똯똢똗똡똠뙇똤똘똞뙄똻똘똳똅똻똡똬똏똔똡똠뙇똠똢똞뙄똻똞똯똅똻똡똯똻똔똡똠뙇똯똢똞뙄똻똘뙄똅똻똡똯똬똗똡똠뙇똣똘뙅뙄똻똞똙똁똻똡똯똢똗똡똠뙇똠똢똞뙄똻똙똅똅똻똡똯똶똔똡똠뙇똬뙇똞뙄똻똘똝똅똻똡똯똜똗똡똠뙇똠똢똞뙄똻똙똅똅똻똡똯똝똔똡똠뙇똧뙇똞뙄똻똘똿똅똻똡똯똝똔똡똠뙇똸똘똞뙄똻똙똯똁똻똡똯똥똔똡똠뙇똬뙇뙅뙄똻똘똧똁똻똡똯똜똔똡똠뙇똬뙇똞뙄똻똙똣똅똻똡똬뙅똔똡똠뙇똣똘뙅뙄똻똙똿똅똻똡똯똟똔똡똠뙇똬똢똞뙄똻똞똧똅똻똡똯똢똗똡똠뙇똣뙇똞뙄똻똘똻똅똻똡똯똶똔똡똠뙇똣똢똞뙄똻똞똿똅똻똡똯똽똔똡똠뙇똣똘뙅뙄똻똙똑똅똻똡똯똟똔똡똠뙇똢똘똞뙄똻똙똝똅똻똡똯똷똔똡똠뙇똧똘똞뙄똻똞뙌똅똻똡똯똯똔똡똠뙇똣똢똞뙄똻똞똝똅똻똡똯똡똔똡똠뙇똬똢똞뙄똻똞똝똅똻똡똯똆똔똡똠뙇똣똘뙅뙄똻똞똑똅똻똡똯똽똔똡똠뙇똣똢똞뙄똻똙똅똅똻똡똯똭똔똡똠뙇똣똘뙅뙄똻똙똑똅똻똡똯똟똔똡똠뙇똢똘똞뙄똻똙똝똅똻똡똯똷똔똡똠뙇똧똘똞뙄똻똙똯똁똻똡똯똥똗똡똠뙇똢똢똞뙄똻똙똳똅똻똡똯똶똔똡똠뙇똧뙇똞뙄똻똞뙄똅똻똡똯똁똔똡똠뙇똣똘뙅뙄똻똙똻똅똻똡똯똜똔똡똠뙇똬뙇똞뙄똻똞똑똅똻똡똯똷똔똡똠뙇", 156546677);
                            source = source.Replace("\\", "");
                            source = source.Replace(Utils.XOR("ⵌⵕⵍ⵺ⵍⵆⴶⵛⵠ⵩ⵑⵍⵕⴰⵊⴳⵐⴲⵧ⵺ⵍⵅ⵫ⵛⵠ⵩ⵑⵇⵕⴰⵊⴳⵒⵕⵧ⵺ⵍⵆⴲⵛⵠ⵩ⵑⵒⵕⴰⵊⴳⵖⵅⵧ⵺ⵍⵅⵉⵛⵠ⵩ⵑⵛⵕⴰⵊⴳⵏⴲⵍ⵺ⵍⵂⴾⴾ",1695886595), info[1]);
                            source = source.Replace("\"<ASSEMBLYPATH>", "@\"" + Assembly.GetEntryAssembly().Location);
                            //using System; public class Program{public static void Main(){ Console.Title = "SkypeBot Updater"; Console.WriteLine("Updating Thr's Skype Bot..."); System.Threading.Thread.Sleep(5000); if(System.Diagnostics.Process.GetProcessesByName("WerFault").Length > 0) { System.Diagnostics.Process.GetProcessesByName("WerFault")[0].Kill(); } try { System.IO.File.Delete("Thr_SkypeBot.dll"); } catch { } new System.Net.WebClient().DownloadFile("<URLLOCATION>", "Thr_SkypeBot.dll"); System.Diagnostics.Process.Start("<ASSEMBLYPATH>"); System.Diagnostics.Process.GetCurrentProcess().Kill(); }}
                            //Update here.
                            CompilerResults results = comp.CompileAssemblyFromSource(param, source);
                            bool errored = false;
                            foreach (CompilerError a in results.Errors)
                            {
                                try
                                {
                                    Console.WriteLine(a.ToString());
                                    
                                }
                                catch { }
                                errored = true;
                            }
                            if (errored) { Console.WriteLine(Utils.XOR("샬샦샹샇샃샷샡생샞샙샩샢샙삽샦삾샯삽살샇샃삿샵생샞샙샩삽샞삽샦삾상삽살샇샃삿샡생샞샙샩샴샙삽샦삾샩새샹샇샃샴살생샞샙샩샾샙삽샦삾샚샦살샇샃삾샟상샞샙샮삼샙삽샦삾샩샘살샇샃삾샃생샞샙샮삼샙삽샦삾샬샦살샇샃삿샡생샞샙샩삼샙삽샦삾샩새샹샇샃삿살생샞샙샮샿샙삽샦삾샮삽살샇샃삿살생샞샙샩샢샙삽샦삾샗새살샇샃삾샟상샞샙샩샷샞삽샦삾샮샘살샇샃삿샽생샞샙샩샿샙삽샦삾샃샘살샇샃삾샃생샞샙샩샺샙삽샦삾샂샘살샇샃샷샟생샞샙샩삽샞삽샦삾샯삽살샇샃삿샥생샞샙샩샿샙삽샦삾샯새살샇샃샷샗생샞샙샩삽샞삽샦삾상삽살샇샃삿샡생샞샙샮샻샙삽샦삾상삽살샇샃삽샡생샞샙샮산", 436650125)); return; }
                            System.Diagnostics.Process.Start(Utils.XOR("鉯鉜鈺鉑鉅鉥鉻鉿鉜鉟鉑鈺鉩鉝鉠鈹鉩鉌鉧鉑鉅鉥鉝鉿鉜鉟鉒鉽鉩鉝鉠鈹鉨鉜鈺鉑鉅鉥鉑鉿鉜鉟鉒鈸鉩鉝鉠鈹鉀鈹鈺鉑鉅鉬鈶鈶", 519279115));
                            Process.GetCurrentProcess().Kill();
                            break;
                    }
                })).Start();
            }
            catch
            {

            }
        }
    }
}
